app/views/dashboard/index.html.erb

                <div class="text">
                    <h2><%= Cobranca.count %></h2>
---
SELECT COUNT(*) FROM `cobrancas`