app/views/cobrancas/index.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = '074c7c7c-7d28-4596-bd42-206073ec5991' LIMIT 1
---
                <tr>
                    <td><%= cobranca.user.first_name %></td>