app/controllers/cobrancas_controller.rb

SELECT `cobrancas`.* FROM `cobrancas`
---
  def index
    @cobrancas = Cobranca.all

INSERT INTO `cobrancas` (`id`, `user_id`, `path`, `value`, `code_id`, `created_at`, `updated_at`) VALUES ('312749cf-2ac6-40b7-9d1f-daee414b414e', '074c7c7c-7d28-4596-bd42-206073ec5991', 'file:///home/bruno/Área%20de%20Trabalho/anexo/', 0.0, 'Controle: 441926699000017', '2020-01-28 15:14:11', '2020-01-28 15:14:11')
---
  def create
    @cobranca = Cobranca.new(cobranca_params)
    @cobranca.path = "file:///home/bruno/Área%20de%20Trabalho/anexo/#{params[:cobranca][:path]}"

    respond_to do |format|
      if @cobranca.save

UPDATE `cobrancas` SET `users_id` = 0, `updated_at` = '2020-01-28 03:32:47' WHERE `cobrancas`.`id` = 2
---
  def update
    respond_to do |format|
      if @cobranca.update(cobranca_params)

SELECT  `cobrancas`.* FROM `cobrancas` WHERE `cobrancas`.`id` = 2 LIMIT 1
---
    def set_cobranca
      @cobranca = Cobranca.find(params[:id])