app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`id`, `first_name`, `cpf_cnpj`, `created_at`, `updated_at`) VALUES ('074c7c7c-7d28-4596-bd42-206073ec5991', 'BRUNO NEVILLE', '05553514169', '2020-01-28 03:57:03', '2020-01-28 03:57:03')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `first_name` = 'Bruno Neville', `updated_at` = '2020-01-28 04:17:51' WHERE `users`.`id` = '074c7c7c-7d28-4596-bd42-206073ec5991'